In [1]:
import numpy as np
import pandas as pd

In [3]:
obj = pd.Series([1,4.3,8,9.3], index = ['d','b','c','a'])

In [4]:
obj

d    1.0
b    4.3
c    8.0
a    9.3
dtype: float64

In [6]:
obj1 = obj.reindex(['a','b','c','d','e'])

In [7]:
obj1

a    9.3
b    4.3
c    8.0
d    1.0
e    NaN
dtype: float64

In [10]:
obj3 = pd.Series(['yellow','green','blue'], index = [0,2,4])
obj3

0    yellow
2     green
4      blue
dtype: object

In [11]:
obj3.reindex(range(6), method='ffill')

0    yellow
1    yellow
2     green
3     green
4      blue
5      blue
dtype: object

In [12]:
frame = pd.DataFrame(np.arange(9).reshape(3,3),
                    index = ['a','c','d'],
                    columns = ['California','Texas','Ohio']
                    )

In [13]:
frame

   California  Texas  Ohio
a           0      1     2
c           3      4     5
d           6      7     8

In [14]:
frame2 = frame.reindex(['a','b','c','d'])

In [15]:
frame2

   California  Texas  Ohio
a         0.0    1.0   2.0
b         NaN    NaN   NaN
c         3.0    4.0   5.0
d         6.0    7.0   8.0

In [17]:
states = ['California','Utah','Texas']
frame.reindex(columns = states)

   California  Utah  Texas
a           0   NaN      1
c           3   NaN      4
d           6   NaN      7

In [19]:
# frame.loc[['a','b','c','d'],states]
frame.loc[list('abcd'),states]

KeyError: 'Passing list-likes to .loc or [] with any missing labels is no longer supported, see https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike'

In [21]:
obj4 = pd.Series(['blue','green','white','black'], index = [3,7,12,17])
print(obj4)
obj4.reindex(range(19), method='ffill')

3      blue
7     green
12    white
17    black
dtype: object

0       NaN
1       NaN
2       NaN
3      blue
4      blue
5      blue
6      blue
7     green
8     green
9     green
10    green
11    green
12    white
13    white
14    white
15    white
16    white
17    black
18    black
dtype: object

In [25]:
obj4 = pd.Series(['blue','green','white','black'], index = [3,7,12,17])
print(obj4)
obj4.reindex(range(19), method='bfill', fill_value = 'brown')

3      blue
7     green
12    white
17    black
dtype: object

0      blue
1      blue
2      blue
3      blue
4     green
5     green
6     green
7     green
8     white
9     white
10    white
11    white
12    white
13    black
14    black
15    black
16    black
17    black
18    brown
dtype: object

3      blue
7     green
12    white
17    black
dtype: object

In [28]:
obj4 = pd.Series(['blue','white','black'], index = [3,8,15])
print(obj4)
obj4.reindex(range(19), method='bfill', limit = 2, fill_value = 'golden')

3      blue
8     white
15    black
dtype: object

0     golden
1       blue
2       blue
3       blue
4     golden
5     golden
6      white
7      white
8      white
9     golden
10    golden
11    golden
12    golden
13     black
14     black
15     black
16    golden
17    golden
18    golden
dtype: object

In [33]:
obj4 = pd.Series(['blue','white','black'], index = [3,8,19])
print(obj4)
obj4.reindex(range(19), method = 'bfill', fill_value = 'Golden', tolerance = 4)

3      blue
8     white
19    black
dtype: object

0       blue
1       blue
2       blue
3       blue
4      white
5      white
6      white
7      white
8      white
9     Golden
10    Golden
11    Golden
12    Golden
13    Golden
14    Golden
15     black
16     black
17     black
18     black
dtype: object

In [34]:
obj5 = obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [35]:
obj5

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [36]:
obj5.drop('c')

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [37]:
obj5.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [38]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],      
                    columns=['one', 'two', 'three', 'four'])

In [39]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [40]:
data.drop(['Ohio','Utah'])

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

In [41]:
data.drop('one', axis = 1)

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

In [42]:
obj5.drop('c', inplace = True)

In [43]:
obj5

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

# Indexing, Selection, and Filtering

In [44]:
obj6 = pd.Series(np.arange(5.), index = list('abcde'))

In [45]:
obj6

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [46]:
obj6['a']

0.0

In [47]:
obj6[0]

0.0

In [48]:
obj6[2:4]

c    2.0
d    3.0
dtype: float64

In [49]:
obj6[['a','b','c']]

a    0.0
b    1.0
c    2.0
dtype: float64

In [50]:
obj6[[0,1,2]]

a    0.0
b    1.0
c    2.0
dtype: float64

In [51]:
obj6[obj6 > 2]

d    3.0
e    4.0
dtype: float64

In [52]:
obj6[2:5]

c    2.0
d    3.0
e    4.0
dtype: float64

In [53]:
obj6

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [54]:
obj6[2:4]

c    2.0
d    3.0
dtype: float64

In [55]:
obj6['c':'e']

c    2.0
d    3.0
e    4.0
dtype: float64

In [56]:
obj6['b':'d'] = 6

In [57]:
obj6

a    0.0
b    6.0
c    6.0
d    6.0
e    4.0
dtype: float64

In [58]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [59]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [60]:
data[['two','four']]

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11
New York   13    15

In [61]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [63]:
data[data['three'] > 2]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [66]:
data > 5

            one    two  three   four
Ohio      False  False  False  False
Colorado  False  False   True   True
Utah       True   True   True   True
New York   True   True   True   True

In [67]:
data[data < 5] = 0

In [68]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [69]:
data.loc['New York',['one','three','four']]

one      12
three    14
four     15
Name: New York, dtype: int64

In [70]:
data.iloc[3,[0,1,3]]

one     12
two     13
four    15
Name: New York, dtype: int64

In [71]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [72]:
data.iloc[[1,2],[0,1]]

          one  two
Colorado    0    5
Utah        8    9

In [73]:
data.loc[:'New York','two']

Ohio         0
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [74]:
data.iloc[:,:3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [75]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [77]:
data['two']

Ohio         0
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [79]:
data[['one','two']]

          one  two
Ohio        0    0
Colorado    0    5
Utah        8    9
New York   12   13

In [81]:
data.loc['Ohio']

one      0
two      0
three    0
four     0
Name: Ohio, dtype: int64

In [82]:
data.loc[['Ohio','New York']]

          one  two  three  four
Ohio        0    0      0     0
New York   12   13     14    15

In [83]:
data.loc[:, 'one']

Ohio         0
Colorado     0
Utah         8
New York    12
Name: one, dtype: int64

In [84]:
data.loc[:, ['one','two']]

          one  two
Ohio        0    0
Colorado    0    5
Utah        8    9
New York   12   13

In [85]:
data.loc['New York','two']

13

In [86]:
data.loc['New York']

one      12
two      13
three    14
four     15
Name: New York, dtype: int64

In [87]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [88]:
data.iloc[:, 2]

Ohio         0
Colorado     6
Utah        10
New York    14
Name: three, dtype: int64

In [89]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [90]:
data.iloc[[0,1],[0,1]]

          one  two
Ohio        0    0
Colorado    0    5

In [95]:
data.at['New York','two']

13

In [97]:
data.iat[2,2]

10

In [98]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [101]:
data.get_value()

AttributeError: 'DataFrame' object has no attribute 'get_value'

# Integer Indexes

In [102]:
s1 = pd.Series(np.arange(3.))

In [103]:
s1

0    0.0
1    1.0
2    2.0
dtype: float64

In [104]:
s1[-1]

KeyError: -1

In [105]:
s1

0    0.0
1    1.0
2    2.0
dtype: float64

In [107]:
s1.loc[:1]

0    0.0
1    1.0
dtype: float64

In [108]:
s1.iloc[:1]

0    0.0
dtype: float64

In [109]:
 s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [110]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [111]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [112]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [113]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [114]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), 
                   columns=list('bcd'),index=['Ohio', 'Texas', 'Colorado'])

In [115]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [116]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [117]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [118]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [119]:
df1.add(df2, fill_value = 0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

In [120]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [121]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [122]:
df1.add(df2, fill_value = 0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

In [123]:
df1.add(df2)

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [3]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), 
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), 
                   columns=list('abcde'))

In [125]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [126]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [127]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [128]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [4]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [129]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [130]:
df1.div(1)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [131]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [132]:
df1.reindex(columns = df2.columns, fill_value = 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [5]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [6]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [7]:
df1.add(df2)

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [8]:
df1.radd(df2)

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [9]:
df1.sub(df2)

     a    b    c    d   e
0  0.0  0.0  0.0  0.0 NaN
1 -1.0 -1.0 -1.0 -1.0 NaN
2 -2.0 -2.0 -2.0 -2.0 NaN
3  NaN  NaN  NaN  NaN NaN

In [10]:
df1.rsub(df2)

     a    b    c    d   e
0  0.0  0.0  0.0  0.0 NaN
1  1.0  1.0  1.0  1.0 NaN
2  2.0  2.0  2.0  2.0 NaN
3  NaN  NaN  NaN  NaN NaN

In [11]:
df1.floordiv(df2)

     a    b    c    d   e
0  NaN  1.0  1.0  1.0 NaN
1  0.0  0.0  0.0  0.0 NaN
2  0.0  0.0  0.0  0.0 NaN
3  NaN  NaN  NaN  NaN NaN

In [12]:
arr = np.arange(12.).reshape((3,4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [13]:
arr[0]

array([0., 1., 2., 3.])

In [14]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [19]:
frame = pd.DataFrame(np.arange(12.).reshape((4,3)),
                    columns = list('bde'),
                    index = ['Utha','Ohio','Texas','Oregon'])

In [20]:
frame

          b     d     e
Utha    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [22]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utha, dtype: float64

In [23]:
frame - series

          b    d    e
Utha    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [26]:
series = pd.Series(range(3), index = list('bef'))

In [27]:
frame + series

          b   d     e   f
Utha    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [28]:
series_2 = frame.iloc[0]

In [29]:
frame - series_2

          b    d    e
Utha    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [30]:
series_3 = frame['d']

In [31]:
series_3

Utha       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [32]:
frame.sub(series_3, axis = 'index')

          b    d    e
Utha   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [33]:
frame

          b     d     e
Utha    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [34]:
frame_1 = pd.DataFrame(np.random.randn(4,3),
                      columns = list('bde'),
                      index = ['Utah','Ohio','Texas','Oregon'])

In [35]:
frame_1

               b         d         e
Utah   -1.154684  1.103242  0.370849
Ohio    0.468833  0.639809 -0.190081
Texas  -1.635539  0.564455  0.181664
Oregon -1.262583  0.425472  0.646176

In [36]:
np.abs(frame_1)

               b         d         e
Utah    1.154684  1.103242  0.370849
Ohio    0.468833  0.639809  0.190081
Texas   1.635539  0.564455  0.181664
Oregon  1.262583  0.425472  0.646176

In [37]:
fun = lambda x: x.max() - x.min()
frame.apply(fun)

b    9.0
d    9.0
e    9.0
dtype: float64

In [38]:
frame

          b     d     e
Utha    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [39]:
frame.apply(fun, axis = 'columns')

Utha      2.0
Ohio      2.0
Texas     2.0
Oregon    2.0
dtype: float64

In [40]:
def f(x):
    return pd.Series([x.max(),x.min()], index =['max','min'])

In [41]:
frame.apply(f)

       b     d     e
max  9.0  10.0  11.0
min  0.0   1.0   2.0

In [42]:
frame

          b     d     e
Utha    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [44]:
frame.apply(f, axis = 'columns')

         max  min
Utha     2.0  0.0
Ohio     5.0  3.0
Texas    8.0  6.0
Oregon  11.0  9.0

In [47]:
frame_1

               b         d         e
Utah   -1.154684  1.103242  0.370849
Ohio    0.468833  0.639809 -0.190081
Texas  -1.635539  0.564455  0.181664
Oregon -1.262583  0.425472  0.646176

In [48]:
format = lambda x: '%2.f' % x

In [49]:
frame_1.applymap(format)

         b   d   e
Utah    -1   1   0
Ohio     0   1  -0
Texas   -2   1   0
Oregon  -1   0   1

In [50]:
frame_1['b'].map(format)

Utah      -1
Ohio       0
Texas     -2
Oregon    -1
Name: b, dtype: object

# Sorting and Ranking

In [51]:
obj = pd.Series(range(4), index = ['d','c','b','a'])

In [52]:
obj.sort_index()

a    3
b    2
c    1
d    0
dtype: int64

In [53]:
frame

          b     d     e
Utha    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [54]:
frame.sort_index()

          b     d     e
Ohio    3.0   4.0   5.0
Oregon  9.0  10.0  11.0
Texas   6.0   7.0   8.0
Utha    0.0   1.0   2.0

In [56]:
frame.sort_index(axis = 1)

          b     d     e
Utha    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [58]:
frame.sort_index(ascending = False)

          b     d     e
Utha    0.0   1.0   2.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0
Ohio    3.0   4.0   5.0

In [59]:
obj2 = pd.Series([1,5,2,0])

In [60]:
obj2.sort_values()

3    0
0    1
2    2
1    5
dtype: int64

In [62]:
frame_3 = pd.DataFrame({'b':[3,4,2,1],'a':[1,4,3,0]})

In [63]:
frame_3

   b  a
0  3  1
1  4  4
2  2  3
3  1  0

In [65]:
frame_3.sort_values(by = 'a')

   b  a
3  1  0
0  3  1
2  2  3
1  4  4

In [66]:
obj2 = pd.Series([499,328,693,343,687,284,561])

In [67]:
obj2

0    499
1    328
2    693
3    343
4    687
5    284
6    561
dtype: int64

In [69]:
obj2.rank(ascending = False)

0    4.0
1    6.0
2    1.0
3    5.0
4    2.0
5    7.0
6    3.0
dtype: float64

In [70]:
obj2.rank(method= 'first')

0    4.0
1    2.0
2    7.0
3    3.0
4    6.0
5    1.0
6    5.0
dtype: float64

In [78]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 
                       'a': [0, 1, 0, 1], 
                       'c': [-2, 5, 8, -2.5]})

In [79]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [80]:
frame.rank()

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

In [81]:
frame.rank(axis = 'columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [82]:
frame.rank(method ='average')

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

In [83]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [84]:
frame.rank(method = 'min')

     b    a    c
0  3.0  1.0  2.0
1  4.0  3.0  3.0
2  1.0  1.0  4.0
3  2.0  3.0  1.0

# Axis Indexes with Duplicate Labels

In [85]:
obj3 = pd.Series(range(5), index =list('aaabc'))

In [86]:
obj3

a    0
a    1
a    2
b    3
c    4
dtype: int64

In [87]:
obj3.index.is_unique

False

In [88]:
obj3['a']

a    0
a    1
a    2
dtype: int64

In [89]:
obj3['c']

4

In [92]:
df3 = pd.DataFrame(np.random.randn(12).reshape((4,3)), index = list('abbc'))

In [93]:
df3

          0         1         2
a -0.966958 -0.259438 -0.976885
b -0.748407  0.518700  0.359805
b -0.265346  0.265913 -0.825251
c  0.763522 -0.836669  1.152780

In [95]:
df3.loc['b']

          0         1         2
b -0.748407  0.518700  0.359805
b -0.265346  0.265913 -0.825251